---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryParamPreset
source: html/f9dab1bc-f89d-fd42-1df3-4385ba9ec0db.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryParamPreset Property

"State"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryParamPreset { get; }
```